КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/КонтурЛогистика_ПЭ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЭ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭксп</name>
    <comment>Уникальный идентификатор документа (УИД) электронного поручения экпедитору, Выдается государственной информационной системой электронных перевозочных документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПорЭкспОтз</name>
    <comment>УИД отозванного электронного поручения экспедитору, вместо которого сформировано данное электронное поручение экспедитору</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДок</name>
    <comment>Дата выдачи поручения экспедитору</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвКлиент</name>
    <comment>Сведения о клиенте - заказчике экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СвЭксп</name>
    <comment>Сведения об экспедиторе</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ДогТрЭксп</name>
    <comment>Реквизиты договора транспортной экспедиции</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>НаимЭкСубСост</name>
    <comment>Наименование экономического субъекта, составляющего файл обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь1с</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНаимДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквНомерДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквДатаДок_ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена информации клиента</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительШаблона</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийРедактированияШаблона</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СценарииРедактированияШаблона</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВходящийШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументШаблон</name>
    <comment>Ссылка на документ шаблон, по которому было создано поручение</comment>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СвГруз</name>
    <attributes>
      <name>ПЭ_СвГруз</name>
      <type>
        <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Предназначено для обмена информацией не предусмотренной форматом</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИныеДанныеКлт</name>
    <attributes>
      <name>ДанныеИОговорки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопрДок</name>
    <attributes>
      <name>РеквНаимДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквНомерДок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквДатаДок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвПредЗак</name>
    <comment>Указывается в случае, если клиент в свою очередь выступает организатором выполнения услуг, связанных с организацией перевозки груза, определенных договором транспортной экспедиции, заключенным с предшествующим заказчиком услуг</comment>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснованияМаршрутов</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Это статусы доставки в Диадок. Логистические статусы смотри в спр. КонтурЛогистика_СостоянияДвиженияДокументооборота</comment>
  <enumValues>
    <name>Пропущен</name>
  </enumValues>
  <enumValues>
    <name>Удален</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ПодготовленКОтправке</name>
  </enumValues>
  <enumValues>
    <name>СформированыФайлыОбмена</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаРаспечатан</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершенаОтказВПодписи</name>
  </enumValues>
  <enumValues>
    <name>РаботаЗавершена</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
    <comment>для титулов, которые были загружены из Диадока</comment>
  </enumValues>
  <enumValues>
    <name>ПолученТребуетОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПолученОбработанСПредупреждением</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_СценарииРедактированияШаблона/КонтурЛогистика_СценарииРедактированияШаблона.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_СценарииРедактированияШаблона</name>
  <enumValues>
    <name>НеРедактируется</name>
    <comment>Шаблон для подписания</comment>
  </enumValues>
  <enumValues>
    <name>ДоступныВсеПоля</name>
    <comment>Документ, созданный из данного шаблона, контрагент сможет  отредактировать - внести дополнения по грузу, адресам или иным данным.</comment>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЭ_Титул1/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ДополнительныеДанныеПроверки = Неопределено, ТребуемоеДействие = Неопределено) Экспорт 
	
	ОДС = КонтурЛогистика_ОбработкаДокументовСервер;
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТаблицаОшибок.Очистить();
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ЭтоОтправкаШаблона = ДокументОбъектИлиСсылка.ЭтоШаблон;
	ОтправкаНезаблокированногоШаблона = ЭтоОтправкаНезаблокированногоШаблона(ДокументОбъектИлиСсылка);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;

	Если Перечисления.КонтурЛогистика_СтатусыТитулов.СтатусДокументаТребуетПроверки(ТекСтатусТитула) Тогда

		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ОрганизацияАвторизации = ДокументОбъектИлиСсылка.СвКлиент;
		Если ДокументОбъектИлиСсылка.ЭтоШаблон Тогда
			ОрганизацияАвторизации = ДокументОбъектИлиСсылка.ОтправительШаблона;
		КонецЕсли;
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка, Неопределено,
		   ТаблицаОшибок, ОрганизацияАвторизации);
		   
		Если Не ЭтоОтправкаШаблона Тогда
			ТребуетсяПодпись = Истина;
			Если ДополнительныеДанныеПроверки <> Неопределено
				И ДополнительныеДанныеПроверки.Свойство("ТребуетсяПодпись") Тогда
				ТребуетсяПодпись = ДополнительныеДанныеПроверки.ТребуетсяПодпись;
			КонецЕсли;
			Если ТребуетсяПодпись Тогда
				ОДС.Валидатор_ПроверитьПодписанта(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТребуемоеДействие,
					ДополнительныеДанныеПроверки);
			КонецЕсли;
		КонецЕсли;   
		
		// Незаблокированный шаблон (ДоступныВсеПоля) может быть неполным — проверки заполненности выводятся как предупреждения.
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок, ОтправкаНезаблокированногоШаблона);
		ПроверитьТабЧастьПартииДокументов(ДокументОбъектИлиСсылка, ТаблицаОшибок, ДополнительныеДанныеПроверки,
			ОтправкаНезаблокированногоШаблона);
		ПроверитьСопроводительныеДокументы(ДокументОбъектИлиСсылка, ТаблицаОшибок, ОтправкаНезаблокированногоШаблона);
		
		// ПроверитьТабЧастьТовары(ДокументОбъектИлиСсылка, ТаблицаОшибок, ТекСтатусТитула);
		
		// КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьДружбуКонтрагентов(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ОДС.Валидатор_ПроверитьОтправителя(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ОДС.Валидатор_ПЭ_ПроверитьРегистрациюЛицВДиадоке(ДокументОбъектИлиСсылка.СвКлиент, ДокументОбъектИлиСсылка.СвЭксп, ТаблицаОшибок);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		// КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		// КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	// КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("НомДок");
	Поля.Добавить("ДатаДок");
	Поля.Добавить("ЭтоШаблон");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "Поручение экспедитору №" + Данные.НомДок + " от " + Формат(Данные.ДатаДок, "ДФ=dd.MM.yy");
	Если Данные.ЭтоШаблон Тогда
		Представление = Представление + " (Шаблон)";
	КонецЕсли;
	
КонецПроцедуры

Функция ТекущаяВерсияСТД() Экспорт
	
	Возврат "kl_porek_wt3_05_02_01";

КонецФункции

// Признак отправки незаблокированного шаблона (сценарий «Доступны все поля»).
// Такой шаблон может быть неполным и не соответствовать XSD — контрагент дополнит данные при редактировании.
//
// Параметры:
//  ДокументОбъектИлиСсылка - ДокументОбъект, ДокументСсылка.КонтурЛогистика_ПЭ_Титул1
//
// Возвращаемое значение:
//  Булево
//
Функция ЭтоОтправкаНезаблокированногоШаблона(ДокументОбъектИлиСсылка) Экспорт
	
	Если Не ДокументОбъектИлиСсылка.ЭтоШаблон Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СценарийРедактирования = ДокументОбъектИлиСсылка.СценарийРедактированияШаблона;
	Если Не ЗначениеЗаполнено(СценарийРедактирования) Тогда
		СценарийРедактирования = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
			"ПЭ_ТипШаблонаДляОтправкиКонтрагенту");
	КонецЕсли;
	
	Возврат СценарийРедактирования = Перечисления.КонтурЛогистика_СценарииРедактированияШаблона.ДоступныВсеПоля;
	
КонецФункции

Функция КатегорияПроверкиЗаполненности(ЗаполненностьКакПредупреждение)
	
	Если ЗаполненностьКакПредупреждение Тогда
		Возврат Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	КонецЕсли;
	
	Возврат Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
КонецФункции

Функция КНД() Экспорт
	
	Возврат "1110486"; 

КонецФункции	

Функция НаимДок() Экспорт
	Возврат "электронное поручение экспедитору, информация клиента";
КонецФункции

Функция СодОпер() Экспорт
	Возврат "представление электронного поручения экспедитору";
КонецФункции

Функция ПолучитьЗапросСпискаДокументовМаршрута(Ссылка) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 = &Титул1
	|   И НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Титул1", Ссылка);
	
	Возврат Запрос;
	
КонецФункции

Функция ОтразитьПартиюТовараВ_ПЭ(ДокументСсылка) Экспорт
	
	Результат = Новый Структура("Документ_ПЭ1, Описание");
	
	РезультатПоиска = НайтиДокумент(ДокументСсылка);
	
	Если РезультатПоиска.СостояниеПоиска = "МожноДобавитьВСуществующийДокумент" Тогда 
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Титул1 = РезультатПоиска.ПЭ1;
		
		ДокументОбъект.Записать();
		
		Результат.Документ_ПЭ1 = РезультатПоиска.ПЭ1;
		Результат.Описание = "Партия была добавлена в существующий документ";
		
	ИначеЕсли РезультатПоиска.СостояниеПоиска = "УжеДобавлен" Тогда
		
		Результат.Документ_ПЭ1 = РезультатПоиска.ПЭ1;
		Результат.Описание = "Партия уже добавлена в существующий документ";
		
	ИначеЕсли РезультатПоиска.СостояниеПоиска = "СоздатьНовый" 
			Или РезультатПоиска.СостояниеПоиска = "СоздатьНовыйИзСпискаЗадач" Тогда
		
		Документ_ПЭ1 = СоздатьДокумент();
		
		МассивПартий = Новый Массив;
		МассивПартий.Добавить(ДокументСсылка);
		ПараметрыЗаполнения = Новый Структура("МассивПартий", МассивПартий);
		
		Документ_ПЭ1.Дата = ТекущаяДатаСеанса();
		Документ_ПЭ1.УстановитьНовыйНомер();  
						
		Документ_ПЭ1.Заполнить(ПараметрыЗаполнения);
		Документ_ПЭ1.Записать();
		
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Титул1 = Документ_ПЭ1.Ссылка;
		
		ДокументОбъект.Записать();
		
		Результат.Документ_ПЭ1 = Документ_ПЭ1.Ссылка;
		Результат.Описание = "Партия была добавлена в новый документ";
	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьДокументГлавныйДокумент(ФайлОбмена) Экспорт
	
	Документ = СоздатьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	Попытка
		
		Документ.УстановитьНовыйНомер();
		Документ.Дата = ТекущаяДатаСеанса();
		Документ.Заполнить(ФайлОбмена);
		Документ.Записать();
		
		ЗаполнитьСвГруз(ФайлОбмена, Документ.Ссылка);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		Информация = ИнформацияОбОшибке();

		ТекстОшибки = "Ошибка при создании документа ПЭ_Титул1 по файлу " + ФайлОбмена
			+ ": " + ПодробноеПредставлениеОшибки(Информация);
		КонтурЛогистика_Метрика.ОбработатьОшибку("СоздатьДокументГлавныйДокумент", ТекстОшибки, ФайлОбмена);
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
	Возврат Документ.Ссылка;
	
КонецФункции
	
Процедура ЗаполнитьСвГруз(ФайлОбмена, Документ)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	ТекстФайла = ФайлОбмена.ТекстXML.Получить();
	XDTO = КС.ПолучитьXDTOпоXML(ТекстФайла);
	Если XDTO = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СодИнфКлт = КС.XDTO_Вычислить(XDTO, "Документ.СодИнфКлнт");
	Если СодИнфКлт = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	МассивСвГруз = КС.XDTO_Вычислить(СодИнфКлт, "СвГруз");
	МассивСвГруз = КС.XDTO_ВычислитьМассивXDTO(МассивСвГруз);
	
	ОбщиеДанные = ЗаполнитьОбщиеРеквизиты(Документ);
	
	Для Каждого Партия Из МассивСвГруз Цикл
		
		ДокументОбъект =  Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СоздатьДокумент();
		ДокументОбъект.УстановитьНовыйНомер();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДанныеЗаполнения = Новый Структура("СодИнфКлт, Партия, ОбщиеДанные", СодИнфКлт, Партия, ОбщиеДанные);
		ДокументОбъект.Заполнить(ДанныеЗаполнения);
		
		Если Документ.ЭтоВходящийШаблон Тогда
			РезультатПроверки = Документы.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПроверитьДокумент(ДокументОбъект);
			ДокументОбъект.Валидация = (РезультатПроверки.КоличествоОшибок = 0);
		КонецЕсли;	
		 
		ДокументОбъект.Титул1 = Документ; 
		
		ДокументОбъект.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры	

Функция ЗаполнитьОбщиеРеквизиты(Документ)
	
	ОбщиеРеквизиты = "НомДок, ДатаДок, СвЭксп, ДогТрЭксп";
	
	МассивОбщиеРеквизиты = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.РазложитьСтрокуВМассивСлов(ОбщиеРеквизиты, ",");
	ОбщиеДанные = Новый Структура(ОбщиеРеквизиты);
	
	Для Каждого Реквизит Из МассивОбщиеРеквизиты Цикл
		ОбщиеДанные[Реквизит] = Документ[Реквизит]; 
	КонецЦикла;
	
	ОбщиеДанные.Вставить("СвКлт", Документ.СвКлиент);	
	Возврат ОбщиеДанные;
	
КонецФункции

Процедура ОтразитьПартииТоваровВ_ПЭ1(Знач МассивДокументСсылка) Экспорт
	
	ТЗ_СтатусыДокументов = НайтиДокументы(МассивДокументСсылка);
	
	ПараметрыОтбора = Новый Структура("СостояниеПоиска", "МожноДобавитьВСуществующийДокумент");
	
	Строки_МожноДобавлятьВСуществующийДокумент = ТЗ_СтатусыДокументов.НайтиСтроки(ПараметрыОтбора);
	СтруктураДокументов = Новый Соответствие; 
	
	Для Каждого СтрокаТЗ Из Строки_МожноДобавлятьВСуществующийДокумент Цикл
		
		Если СтруктураДокументов.Получить(СтрокаТЗ.ПЭ_Титул1) = Неопределено Тогда 
			МассивДокументов = Новый Массив;
			МассивДокументов.Добавить(СтрокаТЗ.ПЭ_Партия);
			СтруктураДокументов.Вставить(СтрокаТЗ.ПЭ_Титул1, МассивДокументов);
		Иначе
			СтруктураДокументов.Получить(СтрокаТЗ.ПЭ_Титул1).Добавить(СтрокаТЗ.ПЭ_Партия);
		КонецЕсли;		
		
	КонецЦикла; 	
	
	Для Каждого Соответсвия Из СтруктураДокументов Цикл
		
		ДокументОбъект = Соответсвия.Ключ.ПолучитьОбъект();
		
		МассивДокументов = Соответсвия.Значение;
		Для Каждого ДокументПЭ_Партия Из МассивДокументов Цикл
			НоваяСтрока = ДокументОбъект.СвГруз.Добавить();
			НоваяСтрока.ПЭ_СвГруз = ДокументПЭ_Партия;
		КонецЦикла;
		
		ДокументОбъект.Записать();
			
	КонецЦикла;
	
	ПараметрыОтбора = Новый Структура("СостояниеПоиска", "СоздатьНовый");
	
	Строки_СоздатьНовый = ТЗ_СтатусыДокументов.НайтиСтроки(ПараметрыОтбора);
	СтруктураДокументов = Новый Соответствие; 
	
	Для Каждого СтрокаТЗ Из Строки_СоздатьНовый Цикл
		
		КлючСтрокиДокумента = СформироватьКлючСтрокиДокумента(СтрокаТЗ);
		
		Если СтруктураДокументов.Получить(КлючСтрокиДокумента) = Неопределено Тогда 
			МассивДокументов = Новый Массив;
			МассивДокументов.Добавить(СтрокаТЗ.ПЭ_Партия);
			СтруктураДокументов.Вставить(КлючСтрокиДокумента, МассивДокументов);
		Иначе
			СтруктураДокументов.Получить(КлючСтрокиДокумента).Добавить(СтрокаТЗ.ПЭ_Партия);
		КонецЕсли;		
		
	КонецЦикла; 	
	
	Для Каждого Соответсвия Из СтруктураДокументов Цикл
		
		МассивПартий = Соответсвия.Значение;
		
		ДокументОбъект = СоздатьДокумент();
		
		ПараметрыЗаполнения = Новый Структура("МассивПартий", МассивПартий);
		
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.УстановитьНовыйНомер();  
						
		ДокументОбъект.Заполнить(ПараметрыЗаполнения);
		ДокументОбъект.Записать();
		
		ДокументОбъект.Записать();
			
	КонецЦикла; 	
	
КонецПроцедуры

Функция СформироватьКлючСтрокиДокумента(СтрокаТЗ)
	
	Возврат СтрокаТЗ.НомДок + Формат(СтрокаТЗ.ДатаДок, "ДФ=yyyyMMdd");
	
КонецФункции	 	

Функция НайтиДокумент(ДокументСсылка, ТолькоИскатьВхождение = Ложь, ИсключаяДокументСсылка = Неопределено) Экспорт
	
	РезультатФункции = Новый Структура("ПЭ1, СостояниеПоиска");
	
	Если ЗначениеЗаполнено(ДокументСсылка.Титул1) тогда 	
		РезультатФункции.ПЭ1 = ДокументСсылка.Титул1;
		РезультатФункции.СостояниеПоиска = "УжеДобавлен";
	КонецЕсли; 
			
	Если ТолькоИскатьВхождение = Ложь Тогда
		Если ЗначениеЗаполнено(ДокументСсылка.НомДок) И ЗначениеЗаполнено(ДокументСсылка.ДатаДок) Тогда		
		
			Запрос = Новый Запрос();
			Запрос.Текст = "ВЫБРАТЬ
			|	КонтурЛогистика_ПЭ_Титул1.Ссылка КАК ПЭ_Титул1
			|ИЗ
			|	Документ.КонтурЛогистика_ПЭ_Титул1 КАК КонтурЛогистика_ПЭ_Титул1
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних КАК
			|			КонтурЛогистика_СтатусыТитуловСрезПоследних
			|		ПО КонтурЛогистика_ПЭ_Титул1.Ссылка = КонтурЛогистика_СтатусыТитуловСрезПоследних.Документ
			|ГДЕ
			|	НЕ КонтурЛогистика_ПЭ_Титул1.ПометкаУдаления
			|	И КонтурЛогистика_ПЭ_Титул1.НомДок = &НомДок
			|	И КонтурЛогистика_ПЭ_Титул1.ДатаДок = &ДатаДок
			|	И КонтурЛогистика_ПЭ_Титул1.СвКлиент = &СвКлиент
			|	И КонтурЛогистика_ПЭ_Титул1.СвЭксп = &СвЭксп
			|	И КонтурЛогистика_ПЭ_Титул1.ДогТрЭксп = &ДогТрЭксп
			|	И (КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус = Значение(Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик)
			|     ИЛИ КонтурЛогистика_СтатусыТитуловСрезПоследних.Статус Есть NULL)";
			
			Запрос.УстановитьПараметр("НомДок", ДокументСсылка.НомДок);
			Запрос.УстановитьПараметр("ДатаДок", ДокументСсылка.ДатаДок);
			Запрос.УстановитьПараметр("СвКлиент", ДокументСсылка.СвКлт);
			Запрос.УстановитьПараметр("СвЭксп", ДокументСсылка.СвЭксп);
			Запрос.УстановитьПараметр("ДогТрЭксп", ДокументСсылка.ДогТрЭксп);

			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				РезультатФункции.ПЭ1 = Выборка.ПЭ_Титул1;
				РезультатФункции.СостояниеПоиска = "МожноДобавитьВСуществующийДокумент";
			Иначе
				РезультатФункции.ПЭ1 = Неопределено;
				РезультатФункции.СостояниеПоиска = "СоздатьНовый";
			КонецЕсли;
		Иначе 
			РезультатФункции.ПЭ1 = Неопределено;
			РезультатФункции.СостояниеПоиска = "СоздатьНовыйИзСпискаЗадач";	
		КонецЕсли;
	КонецЕсли; 
	
	Возврат РезультатФункции;   			 
	
КонецФункции

// Функция выполняет поиск и анализ документов "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут"
// относительно их наличия в документах "КонтурЛогистика_ПЭ_Титул1"
//
// Параметры:
//  МассивДокументСсылка - Массив из ДокументСсылка - на документы "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут" для поиска
//  ИсключаяДокумент - ДокументСсылка - (Необязательный) Документ "КонтурЛогистика_ПЭ_Титул1", который исключается из поиска
//
// Возвращаемое значение:
//  ТаблицаЗначений - Результат анализа со следующими колонками:
//   * ПЭ_Титул1 - ДокументСсылка - Ссылка на найденный документ "КонтурЛогистика_ПЭ_Титул1" 
//   * НомДок - Строка - Номер документа "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут"
//   * ДатаДок - Дата - Дата документа "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут"
//   * ПЭ_Партия - ДокументСсылка - Ссылка на исходный документ "КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут"
//   * СостояниеПоиска - Строка - Статус документа:
//       "СоздатьНовый" - документ не найден в существующих титулах, можно создать новый
//       "МожноДобавитьВСуществующийДокумент" - найден титул с совпадающими номером и датой
//       "УжеДобавлен" - документ уже добавлен в существующий титул
Функция НайтиДокументы(Знач МассивДокументСсылка, ИсключаяДокумент = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.НомДок КАК НомДок,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ДатаДок КАК ДатаДок
	|ПОМЕСТИТЬ ВТ_ДокументыПартииТоваров
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления
	|	И КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка В (&МассивСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_Титул1СвГруз.Ссылка Как ПЭ_Титул1,
	|	ВТ_ДокументыПартииТоваров.Ссылка Как ПЭ_Партия,
	|	Выбор
	|		Когда КонтурЛогистика_ПЭ_Титул1СвГруз.Ссылка Есть Null
	|			Тогда ""НеДобавлен""
	|		Иначе ""УжеДобавлен""
	|	Конец Как СостояниеПоиска,
	|	ВТ_ДокументыПартииТоваров.НомДок,
	|	ВТ_ДокументыПартииТоваров.ДатаДок
	|ПОМЕСТИТЬ ВТ_ДокументыСПризнакомРазнесения
	|ИЗ
	|	ВТ_ДокументыПартииТоваров КАК ВТ_ДокументыПартииТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_Титул1.СвГруз КАК КонтурЛогистика_ПЭ_Титул1СвГруз
	|		ПО КонтурЛогистика_ПЭ_Титул1СвГруз.ПЭ_СвГруз = ВТ_ДокументыПартииТоваров.Ссылка
	|ГДЕ
	|   КонтурЛогистика_ПЭ_Титул1СвГруз.Ссылка Есть Null 
	|	Или (НЕ КонтурЛогистика_ПЭ_Титул1СвГруз.Ссылка.ПометкаУдаления
	|	И НЕ КонтурЛогистика_ПЭ_Титул1СвГруз.Ссылка = &ИсключаяДокумент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕстьNUll(КонтурЛогистика_ПЭ_Титул1.Ссылка, Значение(Документ.КонтурЛогистика_ПЭ_Титул1.ПустаяСсылка)) Как ПЭ_Титул1,
	|	ВТ_ДокументыСПризнакомРазнесения.НомДок КАК НомДок,
	|	ВТ_ДокументыСПризнакомРазнесения.ДатаДок КАК ДатаДок,
	|	ВТ_ДокументыСПризнакомРазнесения.ПЭ_Партия КАК ПЭ_Партия,
	|	ВЫБОР
	|		КОГДА КонтурЛогистика_ПЭ_Титул1.Ссылка Есть NULL
	|			Тогда ""СоздатьНовый""
	|		ИНАЧЕ ""МожноДобавитьВСуществующийДокумент""
	|	КОНЕЦ КАК СостояниеПоиска
	|ИЗ
	|	ВТ_ДокументыСПризнакомРазнесения КАК ВТ_ДокументыСПризнакомРазнесения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_Титул1 КАК КонтурЛогистика_ПЭ_Титул1
	|		ПО КонтурЛогистика_ПЭ_Титул1.НомДок = ВТ_ДокументыСПризнакомРазнесения.НомДок
	|		И КонтурЛогистика_ПЭ_Титул1.ДатаДок = ВТ_ДокументыСПризнакомРазнесения.ДатаДок
	|		И НЕ КонтурЛогистика_ПЭ_Титул1.ПометкаУдаления
	|ГДЕ
	|	ВТ_ДокументыСПризнакомРазнесения.СостояниеПоиска = ""НеДобавлен""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ДокументыСПризнакомРазнесения.ПЭ_Титул1 КАК ПЭ_Титул1,
	|	ВТ_ДокументыСПризнакомРазнесения.НомДок КАК НомДок,
	|	ВТ_ДокументыСПризнакомРазнесения.ДатаДок КАК ДатаДок,
	|	ВТ_ДокументыСПризнакомРазнесения.ПЭ_Партия КАК ПЭ_Партия,
	|	ВТ_ДокументыСПризнакомРазнесения.СостояниеПоиска КАК СостояниеПоиска
	|ИЗ
	|	ВТ_ДокументыСПризнакомРазнесения КАК ВТ_ДокументыСПризнакомРазнесения
	|ГДЕ
	|	ВТ_ДокументыСПризнакомРазнесения.СостояниеПоиска = ""УжеДобавлен""";
	
	Запрос.УстановитьПараметр("МассивСсылка", МассивДокументСсылка);
	Запрос.УстановитьПараметр("ИсключаяДокумент", ИсключаяДокумент);
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ_Результат;   			 
	
КонецФункции	

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	МассивОбязательных.Добавить("НомДок");
	МассивОбязательных.Добавить("ДатаДок");
	МассивОбязательных.Добавить("СвКлиент");
	МассивОбязательных.Добавить("СвЭксп");
	МассивОбязательных.Добавить("ДогТрЭксп"); 
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
		
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ПорЭксп");
	
	МассивКлючевых.Добавить("kl_id");
	
	МассивКлючевых.Добавить("ПользовательПодписант");
	МассивКлючевых.Добавить("ПараметрНастроекПодписания");
	
	МассивКлючевых.Добавить("ЭтоВходящийШаблон");
	МассивКлючевых.Добавить("ДокументШаблон");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок, ЗаполненностьКакПредупреждение = Ложь)
	
	КатегорияОшибкиОбъекта = КатегорияПроверкиЗаполненности(ЗаполненностьКакПредупреждение);
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				ОбязательныйРевизит, КатегорияОшибкиОбъекта, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ЭтоШаблон Тогда
	
		Если Не ЗначениеЗаполнено(Объект.СвКлиент) Тогда 
		
			ТекстОшибки = "Заполните организацию получателя шаблона";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"СвКлиент", КатегорияОшибка, ТекстОшибки, "Заполнить");
		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ОтправительШаблона) Тогда 
		
			ТекстОшибки = "Укажите организацию оформителя шаблона";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					?(Объект.СвЭксп = Объект.ОтправительШаблона, "СвЭксп", "ОтправительШаблона"), КатегорияОшибка, ТекстОшибки, "Заполнить");
		
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДогТрЭксп.НомерДокумента) Тогда 
		
		ТекстОшибки = "Заполните номер для договора экспедиции.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДогТрЭксп.НомерДокумента", КатегорияОшибкиОбъекта, ТекстОшибки, "Заполнить");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДогТрЭксп.ДатаДокумента) Тогда 
		
		ТекстОшибки = "Заполните дату для договора экспедиции.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ДогТрЭксп.ДатаДокумента", КатегорияОшибкиОбъекта, ТекстОшибки, "Заполнить");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДогТрЭксп) Тогда
		
		Справочники.КонтурЛогистика_Договоры.ПроверитьСтороныДоговора(
			Объект.ДогТрЭксп, ТаблицаОшибок, КатегорияОшибкиОбъекта, "ДогТрЭксп");
		
		Если ЗначениеЗаполнено(Объект.СвКлиент)
			И Не Справочники.КонтурЛогистика_Договоры.СторонаДоговораСовпадаетСОрганизациейДиадок(
				Объект.ДогТрЭксп.Организация, Объект.ДогТрЭксп.ОрганизацияИНН, Объект.СвКлиент) Тогда
			
			ТекстОшибки = "Организация в договоре экспедиции не совпадает с заказчиком (клиентом) документа";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
				"ДогТрЭксп.Организация", КатегорияОшибкиОбъекта, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.СвЭксп)
			И Не Справочники.КонтурЛогистика_Договоры.СторонаДоговораСовпадаетСОрганизациейДиадок(
				Объект.ДогТрЭксп.Контрагент, Объект.ДогТрЭксп.КонтрагентИНН, Объект.СвЭксп) Тогда
			
			ТекстОшибки = "Контрагент в договоре экспедиции не совпадает с экспедитором документа";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
				"ДогТрЭксп.Контрагент", КатегорияОшибкиОбъекта, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СвКлиент) Тогда
		Справочники.КонтурЛогистика_ОрганизацииДиадок.ПроверитьРеквизитыУчастникаДляФайлаОбмена(
			Объект.СвКлиент, "СвКлиент", "заказчика", ТаблицаОшибок, КатегорияОшибкиОбъекта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СвЭксп) Тогда
		Справочники.КонтурЛогистика_ОрганизацииДиадок.ПроверитьРеквизитыУчастникаДляФайлаОбмена(
			Объект.СвЭксп, "СвЭксп", "экспедитора", ТаблицаОшибок, КатегорияОшибкиОбъекта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СвКлиент)
		И ЗначениеЗаполнено(Объект.СвЭксп)
		И Объект.СвКлиент = Объект.СвЭксп Тогда
		
		ТекстОшибки = "Заказчик и экспедитор не могут быть одной организацией.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"СвЭксп", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьТабЧастьПартииДокументов(ДокументОбъектИлиСсылка, ТаблицаОшибок, ДополнительныеДанныеПроверки,
		ЗаполненностьКакПредупреждение = Ложь)
	
	КатегорияОшибка = КатегорияПроверкиЗаполненности(ЗаполненностьКакПредупреждение);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Валидация КАК Валидация,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Ссылка,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 В (&Ссылка)
	|	И НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления";
		
	Если Не ДополнительныеДанныеПроверки = Неопределено И ДополнительныеДанныеПроверки.Свойство("МаршрутыГруза") Тогда
		МаршрутыГруза = ДополнительныеДанныеПроверки.МаршрутыГруза;
		Запрос.УстановитьПараметр("Ссылка", МаршрутыГруза);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Титул1", "Ссылка");
	Иначе 
		Запрос.УстановитьПараметр("Ссылка", ДокументОбъектИлиСсылка.Ссылка);	
	КонецЕсли;  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ИмяТЧ = "МаршрутыГруза";
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ТекстОшибки = "В титуле не выбран ни один маршрут"; 
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, , 
					, КатегорияОшибка, ТекстОшибки, "Исправить");
		
	КонецЕсли;	  
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Валидация = Ложь 
			Или Выборка.ПометкаУдаления Тогда 
				 
			Если Выборка.Валидация = Ложь Тогда 
				ТекстОшибки = "В документе " + Выборка.Ссылка + " есть ошибки валидации.";
			Иначе
				ТекстОшибки = "Документ " + Выборка.Ссылка + " помечен на удаление. Необходимо удалить его из титула.";
			КонецЕсли;
		
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, ИмяТЧ, , 
					"МаршрутыГруза", КатегорияОшибка, ТекстОшибки, "Исправить");
	
		КонецЕсли;			
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСопроводительныеДокументы(Объект, ТаблицаОшибок, ЗаполненностьКакПредупреждение = Ложь)

	КатегорияОшибка = КатегорияПроверкиЗаполненности(ЗаполненностьКакПредупреждение);

	Для Каждого Документ Из Объект.СопрДок Цикл
		
		Если Не ЗначениеЗаполнено(Документ.РеквНаимДок)
			Или Не ЗначениеЗаполнено(Документ.РеквНомерДок)
			Или Не ЗначениеЗаполнено(Документ.РеквДатаДок) Тогда
		
			ТекстОшибки = "Для сопроводительного документа не указаны обязательные реквизиты.";	
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СопрДок", Документ.НомерСтроки, 
				"НомерСтроки", КатегорияОшибка, ТекстОшибки, "Указать");
		
		КонецЕсли; 				

	КонецЦикла;
КонецПроцедуры	

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
		Возврат Метаданные.Документы.КонтурЛогистика_ПЭ_Титул1.Реквизиты[ИмяРеквизита].Синоним;
	Исключение
		Возврат ИмяРеквизита;
	КонецПопытки;

КонецФункции

Функция ПолучитьДанныеДляМетрик(Документ) Экспорт
	
	Результат = Новый Структура("Переменные, Path_Category, Path_View");
	Результат.Path_Category = "Подписание и отправка ПЭ1";
	Результат.Path_View = "Документ.КонтурЛогистика_ПЭ_Титул1.Форма.ФормаДокумента";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(МИНИМУМ(КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ОтмПрием), ЛОЖЬ) КАК ПриемВоВладение,
	|	МИНИМУМ(КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1.СвКлиент.ID) КАК BoxIdОтправитель,
	|	ЕСТЬNULL(МИНИМУМ(КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.УказКлнт), ЛОЖЬ) КАК УсловияПеревозки,
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка КАК Маршрут,
	|	МИНИМУМ(ЕСТЬNULL(КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1.ЭтоВходящийШаблон, ЛОЖЬ)) КАК ЭтоВходящийШаблон,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутСвУсл.Ссылка), 0) КАК КоличествоТЭУ
	|ИЗ
	|	Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.СвУсл КАК КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутСвУсл
	|		ПО КонтурЛогистика_ПЭ_ЗаявкаНаМаршрутСвУсл.Ссылка = КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка
	|ГДЕ
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Титул1 = &Титул1
	|	И НЕ КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут.Ссылка";
	
	Запрос.УстановитьПараметр("Титул1", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Переменные = Новый Структура("BoxIdОтправитель, КоличествоМаршрутов, Маршруты");
	Маршруты = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Переменные.BoxIdОтправитель = Выборка.BoxIdОтправитель;	
		Маршрут = Новый Структура("УсловияПеревозки, ПриемВоВладение, ТЭУ, ЭтоВходящийШаблон");
		Маршрут.УсловияПеревозки = ЗначениеЗаполнено(Выборка.УсловияПеревозки);
		Маршрут.ЭтоВходящийШаблон = Выборка.ЭтоВходящийШаблон;
		Маршрут.ТЭУ = Выборка.КоличествоТЭУ > 0;
		Маршрут.ПриемВоВладение = Выборка.ПриемВоВладение;
		Маршруты.Добавить(Маршрут);
	КонецЦикла;
	
	Переменные.Маршруты = Маршруты;
	Переменные.КоличествоМаршрутов = Маршруты.Количество();
	
	Результат.Переменные = Переменные;
	
	Возврат Результат;
	 	
КонецФункции	

#КонецЕсли
